crave/metaSMT/cmake/z3-z3-4.6.0__permutation_matrix.patch
--- src/util/lp/permutation_matrix.h	2017-12-18 15:18:30.000000000 +0100
+++ src/util/lp/permutation_matrix.h	2020-09-08 09:58:33.638123478 +0200
@@ -132,7 +132,7 @@
 
         unsigned size() const { return static_cast<unsigned>(m_rev.size()); }
 
-        unsigned * values() const { return m_permutation; }
+        unsigned * values() const { return m_permutation.c_ptr(); }
 
         void resize(unsigned size) {
             unsigned old_size = m_permutation.size();
